//1. Преобразование строк
//Создайте функцию, которая будет анализировать входящие фразы и применять к ним различные преобразования, делая текст более ироничным или забавным.
//Функция должна уметь распознавать ключевые слова или условия и соответственно изменять фразу.
//Правила проверки и преобразования:
//Если фраза содержит слово "невозможно":
//Преобразование: Замените "невозможно" на "совершенно точно возможно, просто требует времени".
//Если фраза начинается с "Я не уверен":
//Преобразование: Добавьте в конец фразы ", но моя интуиция говорит об обратном".
//Если фраза содержит слово "катастрофа":
//Преобразование: Замените "катастрофа" на "интересное событие".
//Если фраза заканчивается на "без проблем":
//Преобразование: Замените "без проблем" на "с парой интересных вызовов на пути".
//Если фраза содержит только одно слово:
//Преобразование: Добавьте перед словом "Иногда," и после слова ", но не всегда".
//Примеры Тестовых Фраз:
//"Это невозможно выполнить за один день"
//"Я не уверен в успехе этого проекта"
//"Произошла катастрофа на сервере"
//"Этот код работает без проблем"
//"Удача"
fun task1(text: String): String {
    var newtext: String = text
    if ("невозможно" in newtext) {
        newtext = newtext.replace("невозможно", "совершенно точно возможно, просто требует времени")
    }
    if (text.startsWith("Я не уверен")) {
        newtext = newtext+", но моя интуиция говорит об обратном"
    }
    if ("катастрофа" in newtext) {
        newtext = newtext.replace("катастрофа", "интересное событие")
    }
    if (newtext.endsWith("без проблем")) {
        newtext = newtext.replace("без проблем", "с парой интересных вызовов на пути")
    }
    if (" " !in newtext) {
        newtext = "Иногда," + newtext + ", но не всегда"
    }
    return newtext
}
//2. Извлечение даты из строки лога
//У вас есть строка лога, например "Пользователь вошел в систему -> 2021-12-01 09:48:23" (данные могут быть любыми, но формат всегда такой).
//Извлеките отдельно дату и время из этой строки и сразу распечатай их по очереди.
//Используй indexOf или split для получения правой части сообщения.
fun task2(text: String) {
    val datetime: List<String> = text.substring(32).split(" ")
    println(datetime[0])
    println(datetime[1])
}
//3. Маскирование личных данных
//Дана строка с номером кредитной карты, например "4539 1488 0343 6467". Замаскируйте все цифры, кроме последних четырех, символами "*".
fun task3(text: String) {
    println("***************"+text.substring(15))
}
//4. Форматирование адреса электронной почты.
//У вас есть электронный адрес, например "username@example.com". Преобразуйте его в строку "username [at] example [dot] com", используя функцию replace()
fun task4(text: String): String {
    val newtext: String = text.replace("@", " [at] ").replace(".", " [dot] ")
    return newtext
}
//5. Извлечение имени файла из пути.
//Дан путь к файлу, например "C:/Пользователи/Документы/report.txt" или "D:/good.themes/dracula.theme" (может быть любым). Извлеките название файла с расширением.
fun task5(text: String): String {
    return text.split("/").last()
}
//6. Создание аббревиатуры из фразы.
//У вас есть фраза, например "Котлин лучший язык программирования" (может быть любой с разделителями слов - пробел).
//Создайте аббревиатуру из начальных букв слов (например, "ООП").
//Используйте split. Используйте for для перебора слов. Используйте var переменную для накопления первых букв.
fun task6(text: String): String {
    var abbr: String = ""
    for (i in text.split(" ")) {
        abbr+=i[0].uppercase()
    }
    return abbr
}
//7. Все слова с большой буквы
//Напишите метод, который преобразует строку из нескольких слов в строку, где каждое слово начинается с заглавной буквы а все остальные - строчные.
//Используй перебор, анализ символов и замену букв на заглавную с помощью метода uppercase() для конкретной буквы.
fun task7(text: String): String {
    var coll: String = ""
    var newtext: List<String> = text.split(" ")
    for (i in newtext) {
        coll+=i[0].uppercase()+i.substring(1).lowercase()+" "
    }
    return coll.trim()
}
//8. Игра в разведчика
//Напишите шифратор/дешифратор для строки.
//Шифровка производится путём замены двух соседних букв между собой: Kotlin шифруется в oKltni.
//Дешифровка выполняется аналогично.
//Если длина строки - нечётная, в конец добавляется символ пробела до начала шифрования.
//Таким образом все шифрованные сообщения будут с чётной длинной.
//Должно получиться два публичных метода: encrypt() и decrypt() которые принимают строку и печатают результат в консоль.
fun encrypt(text: String): String {
    var newtext: List<String> = (text+" ".repeat(text.length % 2)).chunked(2)
    var res: String = ""
    for (i in newtext) {
        res+=i.reversed()
    }
    return res
}

fun decrypt(text: String): String {
    return encrypt(text)
}

//9. Таблица умножения
//Напишите функцию, которая принимает два числа и выводит таблицу умножения, у которой в заголовках столбцов и строк находятся перемножаемые числа,
//А в перекрестии заголовка и столбца - результат перемножения. Важно: каждый столбец должен быть выровнен по правому краю с помощью шаблона с форматированием строк.
//Размер форматирования каждой строки нужно вычислять динамически для каждого столбца. Результат должен быть похож на этот пример:
fun printMultiplicationTable(columns: Int, rows: Int) {
    val maxValue = columns * rows
    val width = maxValue.toString().length
    print("%${width}d".format(0))
    for (column in 1..columns) {
        print("%${width + 1}d".format(column))
    }
    println()
    for (row in 1..rows) {
        print("%${width}d".format(row))
        for (column in 1..columns) {
            print("%${width + 1}d".format(row * column))
        }
        println()
    }
}
fun main() {
    printMultiplicationTable(30, 40)
}